# Merge
En este script se explica de manera breve las diferentes formas de unir dos dataframe.
La explicación teoríca se encuentra en el script de [Teoría](https://github.com/DanielMontesSerrano/Bootcamp_Abril2023/blob/master/Librerias/Pandas/Merge/Teoría.md#user-content-fnref-1-9878f3ac164785515e3428b4a0cd78f7)

In [7]:
### Importamos las librerías
import pandas as pd
# Creamos los dataframe de los ejemplo
Clientes=pd.DataFrame({'Id_Cliente':[1234,2345,3456,4567,5678],	
          'Nombre':	['Beltrán','Olga','Aurora','Saúl','Ignacio'],
          'Apellido':['García','Bermejo','Siller','Almodóvar','Irin']})

Ultima_Fecha=pd.DataFrame({'Id_Cliente':[4321,2345,3456,4567,7846],
'Fecha':['19-05-2019','25-03-2020','31-07-2020','28-02-2022',
'25-03-2023'],
'Facturado':['7.532€','2.951€','4.569€','6.523€','9.632€']})

In [8]:
## Inner Join
pd.merge(Clientes,Ultima_Fecha,how='inner',on="Id_Cliente")

   Id_Cliente  Nombre   Apellido       Fecha Facturado
0        2345    Olga    Bermejo  25-03-2020    2.951€
1        3456  Aurora     Siller  31-07-2020    4.569€
2        4567    Saúl  Almodóvar  28-02-2022    6.523€

In [9]:
## Left Join
pd.merge(Clientes,Ultima_Fecha,how='left',on="Id_Cliente")

   Id_Cliente   Nombre   Apellido       Fecha Facturado
0        1234  Beltrán     García         NaN       NaN
1        2345     Olga    Bermejo  25-03-2020    2.951€
2        3456   Aurora     Siller  31-07-2020    4.569€
3        4567     Saúl  Almodóvar  28-02-2022    6.523€
4        5678  Ignacio       Irin         NaN       NaN

In [10]:
## Right Join
pd.merge(Clientes,Ultima_Fecha,how='right',on="Id_Cliente")

   Id_Cliente  Nombre   Apellido       Fecha Facturado
0        4321     NaN        NaN  19-05-2019    7.532€
1        2345    Olga    Bermejo  25-03-2020    2.951€
2        3456  Aurora     Siller  31-07-2020    4.569€
3        4567    Saúl  Almodóvar  28-02-2022    6.523€
4        7846     NaN        NaN  25-03-2023    9.632€

In [12]:
## Outer Join
pd.merge(Clientes,Ultima_Fecha,how='outer',on="Id_Cliente")

   Id_Cliente   Nombre   Apellido       Fecha Facturado
0        1234  Beltrán     García         NaN       NaN
1        2345     Olga    Bermejo  25-03-2020    2.951€
2        3456   Aurora     Siller  31-07-2020    4.569€
3        4567     Saúl  Almodóvar  28-02-2022    6.523€
4        5678  Ignacio       Irin         NaN       NaN
5        4321      NaN        NaN  19-05-2019    7.532€
6        7846      NaN        NaN  25-03-2023    9.632€

In [16]:
## Outer Join
### No necesita la Key
pd.merge(Clientes,Ultima_Fecha,how='cross')